Revit 2025 API
ConceptualConstructionShadeType Enumeration
 ConceptualConstructionType values for Shades.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConceptualConstructionShadeType
Public Enumeration ConceptualConstructionShadeType
public enum class ConceptualConstructionShadeType
type ConceptualConstructionShadeType
Members
Member name | Value | Description
BasicShade | 0 |  Basic Shade
NumShadeTypeConstruction | 1 |  Total Number of Shade Type Constructions
InvalidShadeTypeConstruction | -1 |  Invalid value/not set Shade Type Construction
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace